Tekla Open API Reference for Tekla Structures 2025
BoltArray.SetBoltDistY Method
 Sets the Y distance at the index defined by the argument.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetBoltDistY(
	int Index,
	double DistY
)
Public Function SetBoltDistY (
	Index As Integer,
	DistY As Double
) As Boolean
Parameters
Index
Type: System.Int32
The index to the distance list.
DistY
Type: System.Double
The Y distance to be used.
Return Value
Type: Boolean
True if the distance was modified. False if the index is out of range.
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace